In [49]:
import pandas as pd
import os
file: str = "users_EN.csv"
dfs = [pd.read_csv(os.path.join("data", file))]
dfs[0].columns

Index(['UserID', 'UserName', 'Email', 'User_Gender', 'User_BirthDate',
       'User_Country', 'RegistrationDate'],
      dtype='object')

In [50]:
dfs[0].head()

,UserID,UserName,Email,User_Gender,User_BirthDate,User_Country,RegistrationDate
0,1,yildirimsatrettin,muhammetyaman@example.net,Female,04-11-1989,Germany,22-05-2024
1,2,tarhanhasgul,zenginsavki@example.org,Female,09-11-1992,Germany,15-10-2020
2,3,corlumestur,fedentevetoglu@example.org,Female,07-07-1965,France,24-09-2015
3,4,unalsensoy,cbilgin@example.net,Female,14-07-1967,USA,07-12-2016
4,5,abid26,sayin23@example.com,Female,07-05-2005,United Kingdom,04-08-2019

In [51]:
dfs[0].describe()

           UserID
count  300.000000
mean   150.500000
std     86.746758
min      1.000000
25%     75.750000
50%    150.500000
75%    225.250000
max    300.000000

In [52]:
dfs[0].dtypes

UserID               int64
UserName            object
Email               object
User_Gender         object
User_BirthDate      object
User_Country        object
RegistrationDate    object
dtype: object

In [55]:
dfs[0].isna().sum()

UserID              0
UserName            0
Email               0
User_Gender         0
User_BirthDate      0
User_Country        0
RegistrationDate    0
dtype: int64

In [56]:
dfs[0].nunique()

UserID              300
UserName            298
Email               299
User_Gender           3
User_BirthDate      299
User_Country          6
RegistrationDate    287
dtype: int64

In [ ]:
# Give this to gemini
# chat: https://gemini.google.com/app/fa0f46f69892d42f